УТ_для_edt.РасширениеСмарт/src/DataProcessors/РабочееМестоМенеджераПоДоставке/РабочееМестоМенеджераПоДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b83a87b5-25b9-4a22-9a0f-5ddd24e8eeb1">
  <name>РабочееМестоМенеджераПоДоставке</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОбособленнаяЗакупкаПродажа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОформленияПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АлкогольнаяПродукцияВоВскрытойТаре</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СезоннаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>РейтингПродаж</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Марка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Принципал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоллекцияНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоэффициентЕдиницыДляОтчетов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СпособОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СхемаОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЦенника</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Качество</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаДляОтчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПлощадьИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПлощадьЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПлощадьЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПлощадьЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСрокаГодности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодРаздел7ДекларацииНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВестиУчетПоГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетСертификатовНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаАналитическогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКПД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d7abca0-ac91-4ef9-a1ad-32697b4607d2">
    <name>смартНаименованиеСайт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="13dd1676-d9c6-415f-a4e1-cb9414a09577">
    <name>ЕдиницаИзмеренияТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="deac0f00-4a8f-4d18-a043-7799a7111d39">
    <name>КодВидаНоменклатурнойКлассификации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="064e5a5a-2e2f-47ca-9f01-32f70a8b1c1e">
    <name>НаименованиеВидаНоменклатурнойКлассификации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>ДрагоценныеМатериалы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДрагоценныйМатериал</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Расположение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="344b6917-b413-4fae-aadd-d62836822de6">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/DataProcessors/РабочееМестоМенеджераПоДоставке/Forms/ФормаРаспоряженияПоПункту/Module.bsl
#Область Переменные

&НаКлиенте
Перем ХранилищеДанныхКлиент; // Структура, содержащая данные справочной информации

#КонецОбласти

#Область ОбработчикиСобытийФормы

//++ смарт:Подкин #908 17.02.2022 12:18:18
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
    
    Если НЕ РольДоступна("ПолныеПрава") Тогда
        Элементы.ТоварыКДоставке.ТолькоПросмотр=Истина;
    КонецЕсли;
    
    //++ смарт:Подкин #974 11.05.2022 16:20:23           
    МассивСтрокПеревозчик=Распоряжения.НайтиСтроки(Новый Структура("Перевозчик",Справочники.смартПредопределенныеЗначения.ПеревозчикПредзаказы.Значение));
    Если МассивСтрокПеревозчик.Количество() Тогда
        Команда = Команды.Добавить("смартПредзаказТК");
        Команда.Действие = "смартПредзаказТКНажатие";
        
        Если Элементы.Найти("смартПредзаказТК") = Неопределено Тогда 		
            Кнопка = Элементы.Вставить("смартПредзаказТК", Тип("КнопкаФормы"), ,Элементы.ДекорацияНетТоваров);
            Кнопка.Заголовок	= "ПредзаказТК";
            Кнопка.ИмяКоманды	= "смартПредзаказТК";
        КонецЕсли;
    КонецЕсли;
    //-- смарт:Подкин #974 11.05.2022 16:20:23  
	
	//++ #Б4398 смарт: Шляпников 02.10.2025 / Задания на перевозку. Заполнение поля "Вес". Разработка. 
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ВесБрутто", смартФормированиеИнтерфейса.ОписаниеТипаЧисло(18, 3));
	смартФормированиеИнтерфейса.СоздатьРеквизитыТаблицы(ЭтаФорма, "Распоряжения", СтруктураРеквизитов);
	
	СвойстваКолонки = Новый Структура;
	СвойстваКолонки.Вставить("Ширина", 7);
	СвойстваКолонки.Вставить("РастягиватьПоГоризонтали", Ложь);
	СвойстваКолонки.Вставить("ТолькоПросмотр", Истина);
	
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "ТоварыКДоставкеВесБрутто", "Распоряжения", "Вес брутто, кг", 1, "Распоряжения.ВесБрутто", СвойстваКолонки,, "РаспоряженияОбъем");
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СтруктураРеквизитов.Вставить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	СтруктураРеквизитов.Вставить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	СтруктураРеквизитов.Вставить("Количество", смартФормированиеИнтерфейса.ОписаниеТипаЧисло(15, 3));
	СтруктураРеквизитов.Вставить("Вес", смартФормированиеИнтерфейса.ОписаниеТипаСтрока(20));
	СтруктураРеквизитов.Вставить("ВесБрутто", смартФормированиеИнтерфейса.ОписаниеТипаСтрока(20));
	СтруктураРеквизитов.Вставить("Объем", смартФормированиеИнтерфейса.ОписаниеТипаСтрока(20));
	СтруктураРеквизитов.Вставить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	СтруктураРеквизитов.Вставить("ВесЕдиницы", смартФормированиеИнтерфейса.ОписаниеТипаЧисло(18, 6));
	СтруктураРеквизитов.Вставить("ОбъемЕдиницы", смартФормированиеИнтерфейса.ОписаниеТипаЧисло(18, 6));
	СтруктураРеквизитов.Вставить("ВесМаксимум", смартФормированиеИнтерфейса.ОписаниеТипаЧисло(18, 6));
	СтруктураРеквизитов.Вставить("ОбъемМаксимум", смартФормированиеИнтерфейса.ОписаниеТипаЧисло(18, 6));
	СтруктураРеквизитов.Вставить("КоличествоМаксимум", смартФормированиеИнтерфейса.ОписаниеТипаЧисло(18, 6));
	СтруктураРеквизитов.Вставить("Распоряжение", Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.РаспоряжениеНаДоставку.Тип));
	СтруктураРеквизитов.Вставить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	СтруктураРеквизитов.Вставить("ПолучательОтправитель", Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ОтправительПолучательТоваров.Тип));
	СтруктураРеквизитов.Вставить("ВсеТовары", Новый ОписаниеТипов("Булево"));
	СтруктураРеквизитов.Вставить("Длина", смартФормированиеИнтерфейса.ОписаниеТипаСтрока(20));
	СтруктураРеквизитов.Вставить("Ширина", смартФормированиеИнтерфейса.ОписаниеТипаСтрока(20));
	СтруктураРеквизитов.Вставить("Высота", смартФормированиеИнтерфейса.ОписаниеТипаСтрока(20));
	СтруктураРеквизитов.Вставить("ТипУпаковки", Новый ОписаниеТипов("ПеречислениеСсылка.смартТипыУпаковокУпаковочногоЛиста"));
	
	смартФормированиеИнтерфейса.СоздатьРеквизит(ЭтаФорма, "смартТоварыКДоставке", Новый ОписаниеТипов("ДеревоЗначений"));
	смартФормированиеИнтерфейса.СоздатьРеквизитыТаблицы(ЭтаФорма, "смартТоварыКДоставке", СтруктураРеквизитов);
	
	События = Новый Структура;
	События.Вставить("Выбор", "смартВыборТоварыКДоставке");
	
	смартФормированиеИнтерфейса.СздТаблицаФормы(ЭтаФорма, "смартТоварыКДоставке", ЭтаФорма, "смартТоварыКДоставке",,, События, Истина, "ТоварыКДоставке");
	Элементы.смартТоварыКДоставке.Высота = 5;
	Элементы.смартТоварыКДоставке.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
	смартФормированиеИнтерфейса.СздГруппаКолонокТаблицыФормы(ЭтаФорма, "смартТоварыКДоставкеГруппаТовар", "смартТоварыКДоставке", 3, 0, Ложь);
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартТоварыКДоставкеНоменклатура", "смартТоварыКДоставкеГруппаТовар", "Номенклатура", 1, "смартТоварыКДоставке.Номенклатура");
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартТоварыКДоставкеХарактеристика", "смартТоварыКДоставкеГруппаТовар", "Характеристика", 1, "смартТоварыКДоставке.Характеристика");
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартТоварыКДоставкеНазначение", "смартТоварыКДоставкеГруппаТовар", "Назначение", 1, "смартТоварыКДоставке.Назначение");
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартТоварыКДоставкеСерия", "смартТоварыКДоставкеГруппаТовар", "Серия", 1, "смартТоварыКДоставке.Серия");
	Элементы.смартТоварыКДоставкеГруппаТовар.ТолькоПросмотр = Истина;
	
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартТоварыКДоставкеДлина", "смартТоварыКДоставке", "Длина, м", 1, "смартТоварыКДоставке.Длина", СвойстваКолонки);
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартТоварыКДоставкеШирина", "смартТоварыКДоставке", "Ширина, м", 1, "смартТоварыКДоставке.Ширина", СвойстваКолонки);
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартТоварыКДоставкеВысота", "смартТоварыКДоставке", "Высота, м", 1, "смартТоварыКДоставке.Высота", СвойстваКолонки);
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартТоварыКДоставкеВес", "смартТоварыКДоставке", "Вес, кг", 1, "смартТоварыКДоставке.Вес", СвойстваКолонки);
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартТоварыКДоставкеВесБрутто", "смартТоварыКДоставке", "Вес брутто, кг", 1, "смартТоварыКДоставке.ВесБрутто", СвойстваКолонки);
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартТоварыКДоставкеОбъем", "смартТоварыКДоставке", "Объем, м3", 1, "смартТоварыКДоставке.Объем", СвойстваКолонки);
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартТоварыКДоставкеТипУпаковки", "смартТоварыКДоставке", "Тип упаковки", 1, "смартТоварыКДоставке.ТипУпаковки", СвойстваКолонки);
	
	смартФормированиеИнтерфейса.СздГруппаКолонокТаблицыФормы(ЭтаФорма, "смартТоварыКДоставкеГруппаКоличество", "смартТоварыКДоставке", 3, 0, Ложь);
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартТоварыКДоставкеКоличество", "смартТоварыКДоставкеГруппаКоличество", "Количество", 1, "смартТоварыКДоставке.Количество", СвойстваКолонки);
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартТоварыКДоставкеНоменклатураЕдиницаИзмерения", "смартТоварыКДоставкеГруппаКоличество", "Ед. изм", 1, "смартТоварыКДоставке.Номенклатура.ЕдиницаИзмерения", СвойстваКолонки);
	
	Элементы.ТоварыКДоставке.Видимость = Ложь;
	Элементы.РаспоряженияВес.Формат = "";
	Элементы.РаспоряженияОбъем.Формат = "";
	Элементы.смартТоварыКДоставкеВес.Видимость = Ложь;
	
	ЗаполнитьДеревоТоварыКДоставке();
	//-- #Б4398 смарт: Шляпников 02.10.2025

КонецПроцедуры //-- смарт:Подкин #908 17.02.2022 12:18:18

#КонецОбласти

#Область КомандыИСобытияЭлементов

//++ смарт:Подкин #947 12.05.2022 15:29:02
&НаКлиенте
Процедура смартПредзаказТКНажатие(Команда)    
    
    ВсеРаспоряжения=ПолучитьРаспоряжения(); 
    
    Если НЕ ВсеРаспоряжения=Неопределено Тогда
        ПараметрыФормы=Новый Структура;
        ПараметрыФормы.Вставить("Распоряжение",ВсеРаспоряжения);
        ОткрытьФорму("Обработка.РабочееМестоМенеджераПоДоставке.Форма.смарт_Форма",ПараметрыФормы,ЭтаФорма);
    КонецЕсли;   
    
КонецПроцедуры //-- смарт:Подкин #947 12.05.2022 15:29:02

//++ #Б4398 смарт: Шляпников 02.10.2025 / Задания на перевозку. Заполнение поля "Вес". Разработка. 
&НаКлиенте
Процедура смартВыборТоварыКДоставке(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "смартТоварыКДоставкеНоменклатура" 
		ИЛИ Поле.Имя = "смартТоварыКДоставкеХарактеристика"
		ИЛИ Поле.Имя = "смартТоварыКДоставкеНазначение"
		ИЛИ Поле.Имя = "смартТоварыКДоставкеСерия" Тогда
		
		ПоказатьЗначение(Неопределено, Элементы.смартТоварыКДоставке.ТекущиеДанные.Номенклатура);
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

//++ смарт:Подкин #947 12.05.2022 15:29:18
&НаСервере
Функция ПолучитьРаспоряжения()
    ТЗ=ЭтотОбъект.Распоряжения.Выгрузить(,"Распоряжение,ПолучательОтправитель"); 
    Возврат ТаблицуЗначенийВМассив(ТЗ);
КонецФункции //-- смарт:Подкин #947 12.05.2022 15:29:18

  //++ смарт:Подкин #947 12.05.2022 15:29:32
&НаСервереБезКонтекста
Функция ТаблицуЗначенийВМассив(ТаблЗнач)
	Результат=Новый Массив;
	Для Каждого ТекСтр Из ТаблЗнач Цикл
		СтруктураСтроки=Новый Структура;
		Для Каждого ТекКол Из ТаблЗнач.Колонки Цикл
			СтруктураСтроки.Вставить(ТекКол.Имя,ТекСтр[ТекКол.Имя])
		КонецЦикла;
		Результат.Добавить(СтруктураСтроки)
	КонецЦикла;
	Возврат Результат
КонецФункции  //-- смарт:Подкин #947 12.05.2022 15:29:32

//++ #Б4398 смарт: Шляпников 02.10.2025 / Задания на перевозку. Заполнение поля "Вес". Разработка. 
&НаСервере
Функция ЗаполнитьДеревоТоварыКДоставке(Распоряжение = Неопределено, Склад = Неопределено)
	
	Если Распоряжение = Неопределено Тогда
		ТЗТовары = ТоварыКДоставке.Выгрузить();
	Иначе
		ТЗТовары = ТоварыКДоставке.Выгрузить(Новый Структура("Распоряжение,Склад", Распоряжение, Склад));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТноменклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) КАК Высота,
	|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) КАК Ширина,
	|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) КАК Длина,
	|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0) КАК ВесБрутто,
	|	ВЫБОР
	|		КОГДА ВТноменклатура.Ссылка.ВесЗнаменатель = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВТноменклатура.Ссылка.ВесЧислитель / ВТноменклатура.Ссылка.ВесЗнаменатель
	|	КОНЕЦ КАК ВесНетто,
	|	НЕ УпаковкиЕдиницыИзмерения.Ссылка ЕСТЬ NULL КАК ЕстьДанные
	|ИЗ
	|	Справочник.Номенклатура КАК ВТноменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|		ПО ВТноменклатура.Ссылка = УпаковкиЕдиницыИзмерения.Владелец
	|			И ВТноменклатура.Ссылка.ЕдиницаИзмерения = УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения
	|ГДЕ
	|	ВТноменклатура.Ссылка В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", ТЗТовары.ВыгрузитьКолонку("Номенклатура"));
	
	ДанныеНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	Дерево = РеквизитФормыВЗначение("смартТоварыКДоставке");
	Дерево.Строки.Очистить();
	
	Для каждого стр Из ТЗТовары Цикл
		
		НоваяСтрока = Дерево.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, стр);
		
		Если ЗначениеЗаполнено(стр.Серия) Тогда
			
			Для каждого стрУпаковка Из стр.Серия.смартДанныеУпаковочногоЛиста Цикл
				
				стрГабариты = НоваяСтрока.Строки.Добавить();
				стрГабариты.Длина = стрУпаковка.Длина;
				стрГабариты.Ширина = стрУпаковка.Ширина;
				стрГабариты.Высота = стрУпаковка.Высота;
				стрГабариты.Вес = стрУпаковка.Вес;
				стрГабариты.ВесБрутто = стрУпаковка.Вес;
				стрГабариты.Объем = стрУпаковка.Объем;
				стрГабариты.ТипУпаковки = стрУпаковка.ТипУпаковки;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НоваяСтрока.Строки.Количество() = 0 Тогда
			
			НайденныеСтроки = ДанныеНоменклатуры.НайтиСтроки(Новый Структура("Номенклатура", стр.Номенклатура));
			Если НайденныеСтроки.Количество() <> 0  И НайденныеСтроки[0].ЕстьДанные Тогда
				
				стрГабариты = НоваяСтрока.Строки.Добавить();
				стрГабариты.Длина = НайденныеСтроки[0].Длина;
				стрГабариты.Ширина = НайденныеСтроки[0].Ширина;
				стрГабариты.Высота = НайденныеСтроки[0].Высота;
				стрГабариты.Вес = НайденныеСтроки[0].ВесНетто;
				стрГабариты.ВесБрутто = НайденныеСтроки[0].ВесБрутто;
				стрГабариты.Объем = НайденныеСтроки[0].Длина * НайденныеСтроки[0].Ширина * НайденныеСтроки[0].Высота;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НоваяСтрока.Строки.Количество() = 0 Тогда
			
			стрГабариты = НоваяСтрока.Строки.Добавить();
			стрГабариты.Длина = "<нет данных>";
			стрГабариты.Ширина = "<нет данных>";
			стрГабариты.Высота = "<нет данных>";
			стрГабариты.Вес = "<нет данных>";
			стрГабариты.ВесБрутто = "<нет данных>";
			стрГабариты.Объем = "<нет данных>";
			
		Иначе
			
			НоваяСтрока.Длина = НоваяСтрока.Строки.Итог("Длина");
			НоваяСтрока.Ширина = НоваяСтрока.Строки.Итог("Ширина") * НоваяСтрока.Количество;
			НоваяСтрока.Высота = НоваяСтрока.Строки.Итог("Высота");
			НоваяСтрока.Вес = НоваяСтрока.Строки.Итог("Вес") * НоваяСтрока.Количество;
			НоваяСтрока.ВесБрутто = НоваяСтрока.Строки.Итог("ВесБрутто") * НоваяСтрока.Количество;
			НоваяСтрока.Объем = НоваяСтрока.Строки.Итог("Объем") * НоваяСтрока.Количество;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Распоряжение = Неопределено Тогда
		
		Для каждого стрРаспоряжение Из Распоряжения Цикл
			
			НайденныеСтроки = Дерево.Строки.НайтиСтроки(Новый Структура("Распоряжение,Склад", стрРаспоряжение.Распоряжение, стрРаспоряжение.Склад));
			
			стрРаспоряжение.Вес = 0;
			стрРаспоряжение.Объем = 0;
			стрРаспоряжение.ВесБрутто = 0;
			
			Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
				
				стрРаспоряжение.Вес = стрРаспоряжение.Вес + смартОбщегоНазначения.Строка2Число(стрНайденныеСтроки.Вес);
				стрРаспоряжение.Объем = стрРаспоряжение.Объем + смартОбщегоНазначения.Строка2Число(стрНайденныеСтроки.Объем);
				стрРаспоряжение.ВесБрутто = стрРаспоряжение.ВесБрутто + смартОбщегоНазначения.Строка2Число(стрНайденныеСтроки.ВесБрутто);
				
			КонецЦикла;
			
		КонецЦикла;
		
	ИначеЕсли Элементы.Распоряжения.ТекущаяСтрока <> Неопределено Тогда
		
		стрРаспоряжения = Распоряжения.НайтиПоИдентификатору(Элементы.Распоряжения.ТекущаяСтрока);
		
		стрРаспоряжения.ВесБрутто = Дерево.Строки.Итог("ВесБрутто", Ложь);
		стрРаспоряжения.Вес = Дерево.Строки.Итог("Вес", Ложь);
		стрРаспоряжения.Объем = Дерево.Строки.Итог("Объем", Ложь);
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Дерево, "смартТоварыКДоставке");
	МассивИдентификаторов = Новый Массив;
	
	МассивСтрок = ЭтаФорма.смартТоварыКДоставке.ПолучитьЭлементы();
	Для каждого стр Из МассивСтрок Цикл
		МассивИдентификаторов.Добавить(стр.ПолучитьИдентификатор());
	КонецЦикла;
	
	Возврат МассивИдентификаторов;
	
КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("РаспоряженияПриАктивизацииСтрокиОбработчикОжидания")
Процедура смарт_РаспоряженияПриАктивизацииСтрокиОбработчикОжидания()
	ТекущиеДанные = Элементы.Распоряжения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ТоварыКДоставке.ОтборСтрок = Новый ФиксированнаяСтруктура("Распоряжение", NULL);
	Иначе
		Элементы.ТоварыКДоставке.ОтборСтрок = Новый ФиксированнаяСтруктура("Распоряжение,Склад",
		ТекущиеДанные.Распоряжение,ТекущиеДанные.Склад);
	КонецЕсли;

	#Вставка
	//++ #Б4398 смарт: Шляпников 02.10.2025 / Задания на перевозку. Заполнение поля "Вес". Разработка. 
	Если ТекущиеДанные = Неопределено Тогда
		МассивИдентификаторов = ЗаполнитьДеревоТоварыКДоставке();
	Иначе
		МассивИдентификаторов = ЗаполнитьДеревоТоварыКДоставке(ТекущиеДанные.Распоряжение, ТекущиеДанные.Склад);
	КонецЕсли;
	
	Для каждого стрДерева Из МассивИдентификаторов Цикл
		Элементы.смартТоварыКДоставке.Развернуть(стрДерева, Истина);
	КонецЦикла;
	//-- #Б4398 смарт: Шляпников 02.10.2025
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти
